app_service/app/controllers/users_controller.rb

  def index
    #3 columns currently, so make per_page % 3 == 0
    #ordered by image uploads
    @users = User.paginate(page: params[:page], :per_page => 24).order("ImageUploads DESC")
---
SELECT  "users".* FROM "users" ORDER BY ImageUploads DESC name ASC LIMIT ? OFFSET ?  [["LIMIT", 24], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def destroy
    @user = User.find(params[:id])
    flash[:success] = @user.name+" deleted"
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 64]]

  def reset
    @user = User.find(params[:id])
    @user.ImageUploads = 0
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 187], ["LIMIT", 1]]
UPDATE "users" SET "ImageUploads" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["ImageUploads", 0], ["updated_at", "2018-10-17 23:46:42.452575"], ["id", 187]]

  def promote
    @user = User.find(params[:id])
    @user.admin = true
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 1], ["updated_at", "2018-10-22 00:01:04.645811"], ["id", 27]]

  def demote
    @user = User.find(params[:id])
    @user.admin = false
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 0], ["updated_at", "2018-10-22 00:02:06.511659"], ["id", 27]]