app_service/app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" ORDER BY name DESC LIMIT ? OFFSET ?  [["LIMIT", 24], ["OFFSET", 0]]